tap "av1155/scripts", "https://github.com/av1155/scripts.git"
tap "getsentry/tools"
tap "heroku/brew"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "oven-sh/bun"
tap "raine/workmux"
tap "samtay/tui"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "teamookla/speedtest"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Extremely Fast Compression algorithm
brew "lz4"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# ChatGPT in the terminal
brew "ata"
# Automatic configure script builder
brew "autoconf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Hacker News in your terminal
brew "circumflex"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# Library for USB device access
brew "libusb"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# LLM inference in C/C++
brew "llama.cpp"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Package manager for the Lua programming language
brew "luarocks"
# Fast, async, resource-friendly link checker
brew "lychee"
# Text-based web browser
brew "lynx"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Package for scientific computing with Python
brew "numpy"
# Development kit for the Java programming language
brew "openjdk"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# Multithreaded PNG optimizer written in Rust
brew "oxipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Web-based PostgreSQL database browser
brew "pgweb"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern watch command
brew "viddy"
# Simple terminal image viewer written in Rust
brew "viu"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Sentry command-line tool for error monitoring and debugging
brew "getsentry/tools/sentry"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Opinionated workflow tool that orchestrates git worktrees and tmux
brew "raine/workmux/workmux"
# Tetris in your terminal
brew "samtay/tui/tetris"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Hardware benchmarking utility
cask "cinebench"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Clipboard manager for developers
cask "flycut"
cask "font-noto-emoji"
cask "font-noto-sans-symbols-2"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# OpenPGP/GnuPG crypto, sign and key management tool
cask "gpgfrontend"
# Tool to optimise images to a smaller size
cask "imageoptim"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Kubernetes IDE
cask "lens"
# Discover, download, and run local LLMs
cask "lm-studio"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Speech recognition tool
cask "macwhisper"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Home media player
cask "plex"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management
cask "sequel-ace"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist-app"
# AI image upscaler
cask "upscayl"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "pdconsec.vscode-print"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "silesky.toggle-boolean"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.console-ninja"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xaver.clang-format"
go "github.com/koron/iferr"
